jonfleming/voice-recorder/sdkconfig.defaults
# Voice Recorder - default Waveshare ESP32-S3 AMOLED 1.8" (368x448 QSPI, CO5300)
# For 2.06" 410x502 build: run `idf.py -D SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.2_06" build`
# or menuconfig → Voice Recorder Config → Target board → 2.06"
CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# PSRAM / Flash
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Board selection (see main/Kconfig.projbuild → choice TARGET_BOARD)
CONFIG_TARGET_BOARD_1_8=y
# CONFIG_TARGET_BOARD_2_06 is not set

# BSP configs (mirrors waveshare BSP Kconfig)
CONFIG_BSP_I2C_NUM=1
CONFIG_BSP_I2S_NUM=1
CONFIG_BSP_SPIFFS_MOUNT_POINT="/spiffs"
CONFIG_BSP_SPIFFS_PARTITION_LABEL="storage"
CONFIG_BSP_SPIFFS_MAX_FILES=5
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=100
CONFIG_BSP_LCD_RGB_BOUNCE_BUFFER_HEIGHT=20

# Application: audio / buttons
CONFIG_RECORDER_SAMPLE_RATE=16000
CONFIG_RECORDER_BITS_PER_SAMPLE=16
CONFIG_RECORDER_CHANNELS=1
CONFIG_BUTTON_A_GPIO=0
CONFIG_BUTTON_B_GPIO=-1
CONFIG_BUTTON_DEBOUNCE_MS=50
CONFIG_BUTTON_SHORT_PRESS_MS=50
CONFIG_BUTTON_LONG_PRESS_MS=1000

# FATFS long filenames required for YYYYMMDD_HHMMSS.wav (LFN HEAP, not NONE)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_LONG_FILENAMES=y
# CONFIG_FATFS_LFN_NONE is overridden by HEAP=y via defconfig processing

# LVGL
CONFIG_LVGL_PORT_TASK_STACK_SIZE=8192
CONFIG_LVGL_PORT_TASK_PRIORITY=5

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_FREERTOS_HZ=1000
